------------------------------------------------------------------------------------------------------------
      name:  ldi
       log:  /project/logs/logfile_15_Apr_2022-21_37_49-statauser.log
  log type:  text
 opened on:  15 Apr 2022, 21:37:49

. 
. /* It will provide some info about how and when the program was run */
. /* See https://www.stata.com/manuals13/pcreturn.pdf#pcreturn */
. local variant = cond(c(MP),"MP",cond(c(SE),"SE",c(flavor)) )  

. // alternatively, you could use 
. // local variant = cond(c(stata_version)>13,c(real_flavor),"NA")  
. 
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===

. di "Stata version: `c(stata_version)'"
Stata version: 17

. di "Updated as of: `c(born_date)'"
Updated as of: 13 Dec 2021

. di "Variant:       `variant'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    24

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Unix 

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. di "=========================="
==========================

. 
. 
. /* install any packages locally */
. capture mkdir "$rootdir/ado"

. sysdir set PERSONAL "$rootdir/ado/personal"

. sysdir set PLUS     "$rootdir/ado/plus"

. sysdir set SITE     "$rootdir/ado/site"

. sysdir
   STATA:  /usr/local/stata/
    BASE:  /usr/local/stata/ado/base/
    SITE:  /project/ado/site/
    PLUS:  /project/ado/plus/
PERSONAL:  /project/ado/personal/
OLDPLACE:  ~/ado/

. 
. /* add packages to the macro */
. 
.     
.     if !missing("`ssc_packages'") {
.         foreach pkg in `ssc_packages' {
  2.             capture which `pkg'
  3.             if _rc == 111 {                 
  4.                dis "Installing `pkg'"
  5.                 ssc install `pkg', replace
  6.             }
  7.             which `pkg'
  8.         }
Installing cem
checking cem consistency and verifying not already installed...
installing into /project/ado/plus/...
installation complete.
/project/ado/plus/c/cem.ado
.     }

. 
. /*==============================================================================================*/
. /* If you need to "net install" packages, add lines to this section                             */
.     * Install packages using net
.     *  net install yaml, from("https://raw.githubusercontent.com/gslab-econ/stata-misc/master/")
.     
. /* other commands, rarely used */
. 
. /*==============================================================================================*/
. /* after installing all packages, it may be necessary to issue the mata mlib index command */
. /* This should always be the LAST command after installing all packages                    */
. 
.         mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataopt;lmatamcmc;lmataado;lmatasvy;lmatamixlog;lmatasp;lmatameta;lmatapath;lmatafc;lmatalass
> o;lmatanumlib;lmatatab;lmatasem;lmatacollect;lmataerm;lmatapostest;lmatami;lmatapss;lmatagsem;lmatabma;lce
> m

. 
. 
. 
. use appelloyle_jprdata.dta, clear

. 
. *Table 1: final equations
. 
. *Economic EQ
. reg  v3Mdiff truthvictim fv8 fv10 fv11 fv34 xratf labor v64mean 

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(8, 86)        =      7.90
       Model |   337328847         8  42166105.8   Prob > F        =    0.0000
    Residual |   459191734        86  5339438.77   R-squared       =    0.4235
-------------+----------------------------------   Adj R-squared   =    0.3699
       Total |   796520581        94   8473623.2   Root MSE        =    2310.7

------------------------------------------------------------------------------
     v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 truthvictim |   1532.608   629.3997     2.44   0.017     281.4027    2783.813
         fv8 |  -.0576056   .1336857    -0.43   0.668    -.3233639    .2081527
        fv10 |   1.05e-08   1.67e-09     6.30   0.000     7.22e-09    1.39e-08
        fv11 |   .7239311   21.29794     0.03   0.973    -41.61497    43.06283
        fv34 |   132.5744   208.0041     0.64   0.526     -280.924    546.0728
       xratf |  -49.21992   13.56125    -3.63   0.000    -76.17879   -22.26105
       labor |    14.7194   25.45351     0.58   0.565    -35.88051    65.31931
     v64mean |    17.3946   30.28764     0.57   0.567    -42.81524    77.60445
       _cons |  -2011.642   2677.858    -0.75   0.455    -7335.047    3311.763
------------------------------------------------------------------------------

. 
. *Institutions EQ
. reg  v3Mdiff truthvictim fv27 polity2 

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(3, 91)        =      5.59
       Model |   123863971         3  41287990.3   Prob > F        =    0.0015
    Residual |   672656610        91  7391830.88   R-squared       =    0.1555
-------------+----------------------------------   Adj R-squared   =    0.1277
       Total |   796520581        94   8473623.2   Root MSE        =    2718.8

------------------------------------------------------------------------------
     v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 truthvictim |   1654.683   722.8906     2.29   0.024     218.7499    3090.617
        fv27 |   4389.135   1366.293     3.21   0.002     1675.161    7103.108
     polity2 |  -99.63924   61.23915    -1.63   0.107    -221.2833    22.00482
       _cons |  -632.5873   459.1693    -1.38   0.172    -1544.671    279.4962
------------------------------------------------------------------------------

. 
. *Conflict EQ
. reg  v3Mdiff truthvictim damage cw_duration_lag  peace_agreement_lag victory_lag 

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(5, 89)        =      3.21
       Model |   121783947         5  24356789.4   Prob > F        =    0.0103
    Residual |   674736634        89  7581310.49   R-squared       =    0.1529
-------------+----------------------------------   Adj R-squared   =    0.1053
       Total |   796520581        94   8473623.2   Root MSE        =    2753.4

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   2590.535   844.9551     3.07   0.003     911.6268    4269.442
             damage |   10.01059   10.58516     0.95   0.347     -11.0219    31.04307
    cw_duration_lag |  -25.54252   42.52396    -0.60   0.550    -110.0367    58.95169
peace_agreement_lag |  -2497.987   885.3799    -2.82   0.006    -4257.218   -738.7559
        victory_lag |  -1321.899   642.4007    -2.06   0.043    -2598.335   -45.46237
              _cons |   1418.316   510.0411     2.78   0.007     404.8752    2431.757
-------------------------------------------------------------------------------------

. 
. *Final EQ
. reg v3Mdiff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag 
>  coldwar polity2 xratf labor v64mean

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(15, 79)       =      5.57
       Model |   409518586        15  27301239.1   Prob > F        =    0.0000
    Residual |   387001995        79  4898759.43   R-squared       =    0.5141
-------------+----------------------------------   Adj R-squared   =    0.4219
       Total |   796520581        94   8473623.2   Root MSE        =    2213.3

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   1960.282   702.9921     2.79   0.007     561.0109    3359.552
                fv8 |  -.1109698   .1329014    -0.83   0.406    -.3755034    .1535639
               fv10 |   1.10e-08   1.74e-09     6.30   0.000     7.49e-09    1.44e-08
               fv11 |   37.39983   23.23864     1.61   0.112    -8.855522    83.65519
               fv34 |   198.8226   201.5904     0.99   0.327    -202.4332    600.0783
               fv27 |   2557.954   1459.599     1.75   0.084    -347.3053    5463.213
        victory_lag |  -33.96899   650.7248    -0.05   0.958    -1329.204    1261.266
    cw_duration_lag |    .811075   35.54318     0.02   0.982    -69.93586    71.55801
             damage |   28.37878    10.2419     2.77   0.007     7.992786    48.76478
peace_agreement_lag |  -1215.137   793.8265    -1.53   0.130     -2795.21    364.9346
            coldwar |   81.53108   654.0918     0.12   0.901    -1220.406    1383.468
            polity2 |  -90.16887    56.3093    -1.60   0.113    -202.2497    21.91198
              xratf |  -42.51594    13.8877    -3.06   0.003    -70.15872   -14.87316
              labor |   9.843716   25.52797     0.39   0.701    -40.96844    60.65587
            v64mean |   3.475077   32.99319     0.11   0.916    -62.19622    69.14638
              _cons |  -1278.322   2852.294    -0.45   0.655    -6955.671    4399.027
-------------------------------------------------------------------------------------

. 
. 
. *robustness checks - using different measure of FDI inflows.
. 
. *Institutions EQ
. reg  v2diff truthvictim fv8 fv10 fv11 fv34 xratf labor v64mean 

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(8, 86)        =      1.62
       Model |  1736.69173         8  217.086466   Prob > F        =    0.1313
    Residual |  11535.5519        86  134.134325   R-squared       =    0.1309
-------------+----------------------------------   Adj R-squared   =    0.0500
       Total |  13272.2437        94  141.194082   Root MSE        =    11.582

------------------------------------------------------------------------------
      v2diff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 truthvictim |   10.06863   3.154632     3.19   0.002     3.797429    16.33983
         fv8 |   .0000669     .00067     0.10   0.921    -.0012651    .0013989
        fv10 |  -6.41e-12   8.39e-12    -0.76   0.447    -2.31e-11    1.03e-11
        fv11 |   -.007576    .106748    -0.07   0.944     -.219784     .204632
        fv34 |   .6464395   1.042543     0.62   0.537    -1.426067    2.718947
       xratf |   .0233245   .0679707     0.34   0.732    -.1117968    .1584458
       labor |   .0954712   .1275763     0.75   0.456     -.158142    .3490845
     v64mean |  -.0444104   .1518056    -0.29   0.771    -.3461899     .257369
       _cons |  -1.937801   13.42177    -0.14   0.886    -28.61939    24.74379
------------------------------------------------------------------------------

. 
. *domestic institutions
. reg  v2diff truthvictim fv27 polity2 

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(3, 91)        =      3.96
       Model |  1534.02193         3  511.340645   Prob > F        =    0.0105
    Residual |  11738.2217        91  128.991448   R-squared       =    0.1156
-------------+----------------------------------   Adj R-squared   =    0.0864
       Total |  13272.2437        94  141.194082   Root MSE        =    11.357

------------------------------------------------------------------------------
      v2diff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 truthvictim |   10.23363   3.019792     3.39   0.001     4.235183    16.23207
        fv27 |  -3.980527   5.707532    -0.70   0.487    -15.31784    7.356784
     polity2 |  -.0022557   .2558195    -0.01   0.993    -.5104097    .5058983
       _cons |   1.926166   1.918127     1.00   0.318    -1.883958    5.736289
------------------------------------------------------------------------------

. 
. *Conflict EQ
. reg  v2diff truthvictim damage cw_duration_lag  peace_agreement_lag victory_lag 

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(5, 89)        =      5.23
       Model |  3014.16172         5  602.832344   Prob > F        =    0.0003
    Residual |  10258.0819        89  115.259348   R-squared       =    0.2271
-------------+----------------------------------   Adj R-squared   =    0.1837
       Total |  13272.2437        94  141.194082   Root MSE        =    10.736

-------------------------------------------------------------------------------------
             v2diff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   9.587425   3.294576     2.91   0.005     3.041172    16.13368
             damage |   .1515483   .0412727     3.67   0.000     .0695402    .2335563
    cw_duration_lag |   .0544588   .1658058     0.33   0.743    -.2749937    .3839114
peace_agreement_lag |  -.1360369   3.452197    -0.04   0.969    -6.995479    6.723405
        victory_lag |  -1.375591   2.504794    -0.55   0.584    -6.352562    3.601381
              _cons |   1.883855   1.988708     0.95   0.346    -2.067666    5.835376
-------------------------------------------------------------------------------------

. 
. *Final EQ
. reg v2diff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag  
> coldwar polity2 xratf labor v64mean

      Source |       SS           df       MS      Number of obs   =        95
-------------+----------------------------------   F(15, 79)       =      2.18
       Model |  3884.04656        15  258.936437   Prob > F        =    0.0139
    Residual |  9388.19711        79  118.837938   R-squared       =    0.2926
-------------+----------------------------------   Adj R-squared   =    0.1583
       Total |  13272.2437        94  141.194082   Root MSE        =    10.901

-------------------------------------------------------------------------------------
             v2diff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   8.689032   3.462461     2.51   0.014     1.797175    15.58089
                fv8 |  -.0001468   .0006546    -0.22   0.823    -.0014498    .0011561
               fv10 |  -1.12e-12   8.56e-12    -0.13   0.897    -1.82e-11    1.59e-11
               fv11 |   .1958079   .1144578     1.71   0.091    -.0320145    .4236304
               fv34 |    1.07808   .9928976     1.09   0.281    -.8982334    3.054393
               fv27 |  -4.049856   7.188993    -0.56   0.575    -18.35919    10.25948
        victory_lag |  -3.714233   3.205028    -1.16   0.250    -10.09368    2.665216
    cw_duration_lag |   .0489948   .1750616     0.28   0.780    -.2994565    .3974461
             damage |    .208731   .0504447     4.14   0.000     .1083234    .3091386
peace_agreement_lag |  -1.291821    3.90985    -0.33   0.742    -9.074183     6.49054
            coldwar |   1.299452   3.221612     0.40   0.688    -5.113005     7.71191
            polity2 |  -.1294524   .2773414    -0.47   0.642    -.6814865    .4225818
              xratf |  -.0154053   .0684014    -0.23   0.822    -.1515549    .1207442
              labor |   .0911415   .1257334     0.72   0.471    -.1591247    .3414076
            v64mean |   .1009756    .162502     0.62   0.536    -.2224766    .4244278
              _cons |  -7.378467   14.04846    -0.53   0.601    -35.34123     20.5843
-------------------------------------------------------------------------------------

. 
. *human rights robustness checks
. 
. *adding physical integrity
. reg v3Mdiff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag 
>  coldwar polity2 xratf labor v64mean physint

      Source |       SS           df       MS      Number of obs   =        79
-------------+----------------------------------   F(16, 62)       =      4.77
       Model |   432818414        16  27051150.9   Prob > F        =    0.0000
    Residual |   351433866        62  5668288.16   R-squared       =    0.5519
-------------+----------------------------------   Adj R-squared   =    0.4362
       Total |   784252280        78  10054516.4   Root MSE        =    2380.8

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   2133.077   822.2534     2.59   0.012     489.4162    3776.739
                fv8 |   -.176196   .1491916    -1.18   0.242    -.4744257    .1220337
               fv10 |   1.24e-08   2.02e-09     6.14   0.000     8.37e-09    1.65e-08
               fv11 |   42.33593    27.4409     1.54   0.128    -12.51765    97.18951
               fv34 |   200.3184   243.1677     0.82   0.413    -285.7668    686.4037
               fv27 |   3145.249   1692.866     1.86   0.068    -238.7413     6529.24
        victory_lag |   220.9449   805.3746     0.27   0.785    -1388.976    1830.866
    cw_duration_lag |    27.0354   41.39789     0.65   0.516     -55.7178    109.7886
             damage |   30.89931    11.7226     2.64   0.011     7.466153    54.33246
peace_agreement_lag |  -1518.375   887.2848    -1.71   0.092    -3292.032    255.2823
            coldwar |   207.4262   937.5522     0.22   0.826    -1666.714    2081.566
            polity2 |  -118.6027   67.82003    -1.75   0.085     -254.173    16.96756
              xratf |   -42.6353   15.23261    -2.80   0.007    -73.08486   -12.18574
              labor |  -24.06951   33.56166    -0.72   0.476    -91.15831     43.0193
            v64mean |  -20.85745   40.65579    -0.51   0.610    -102.1272    60.41231
            physint |   267.0512   158.4238     1.69   0.097    -49.63347    583.7358
              _cons |   1147.329   3514.839     0.33   0.745    -5878.734    8173.391
-------------------------------------------------------------------------------------

. 
. *adding phystical integrity and worker
. reg v3Mdiff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag 
>  coldwar polity2 xratf labor v64mean physint worker

      Source |       SS           df       MS      Number of obs   =        79
-------------+----------------------------------   F(17, 61)       =      5.24
       Model |   465583344        17  27387255.6   Prob > F        =    0.0000
    Residual |   318668936        61  5224080.92   R-squared       =    0.5937
-------------+----------------------------------   Adj R-squared   =    0.4804
       Total |   784252280        78  10054516.4   Root MSE        =    2285.6

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   2010.809   790.8857     2.54   0.014      429.335    3592.283
                fv8 |  -.1890942    .143319    -1.32   0.192    -.4756783    .0974899
               fv10 |   1.36e-08   2.00e-09     6.80   0.000     9.60e-09    1.76e-08
               fv11 |   22.79529   27.47495     0.83   0.410    -32.14427    77.73485
               fv34 |   166.5508   233.8342     0.71   0.479    -301.0295    634.1312
               fv27 |   2375.984   1653.954     1.44   0.156     -931.301    5683.269
        victory_lag |   325.4894   774.2995     0.42   0.676    -1222.818    1873.797
    cw_duration_lag |    43.6266   40.29107     1.08   0.283    -36.94036    124.1936
             damage |   27.55957   11.33264     2.43   0.018     4.898557    50.22058
peace_agreement_lag |  -1576.439   852.1241    -1.85   0.069    -3280.366    127.4885
            coldwar |   353.3652   901.9506     0.39   0.697    -1450.197    2156.927
            polity2 |  -124.3493   65.14881    -1.91   0.061    -254.6224    5.923837
              xratf |  -48.03501   14.78167    -3.25   0.002    -77.59278   -18.47725
              labor |  -32.55587   32.39747    -1.00   0.319    -97.33862    32.22688
            v64mean |  -13.43696   39.14256    -0.34   0.733    -91.70735    64.83343
            physint |    294.277   152.4776     1.93   0.058    -10.62077    599.1748
             worker |   985.3373   393.4461     2.50   0.015     198.5932    1772.081
              _cons |   350.8207   3389.261     0.10   0.918    -6426.426    7128.067
-------------------------------------------------------------------------------------

. 
. *adding phystical, integrity, worker's rights, secondary education (women)
. reg v3Mdiff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag 
>  coldwar polity2 xratf labor v64mean physint worker v60mean

      Source |       SS           df       MS      Number of obs   =        78
-------------+----------------------------------   F(18, 59)       =      4.87
       Model |   468598874        18  26033270.8   Prob > F        =    0.0000
    Residual |   315567464        59  5348601.08   R-squared       =    0.5976
-------------+----------------------------------   Adj R-squared   =    0.4748
       Total |   784166338        77  10183978.4   Root MSE        =    2312.7

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   2037.338   802.2997     2.54   0.014     431.9403    3642.736
                fv8 |  -.1730138    .146723    -1.18   0.243     -.466606    .1205783
               fv10 |   1.36e-08   2.09e-09     6.51   0.000     9.43e-09    1.78e-08
               fv11 |  -3.421952   44.48488    -0.08   0.939    -92.43599    85.59208
               fv34 |   156.4577   237.0156     0.66   0.512    -317.8094    630.7249
               fv27 |   2727.616    1744.13     1.56   0.123    -762.3803    6217.612
        victory_lag |   309.1301   803.5392     0.38   0.702    -1298.748    1917.008
    cw_duration_lag |   49.84314   41.58311     1.20   0.235    -33.36447    133.0508
             damage |   29.17542   12.18615     2.39   0.020     4.790989    53.55986
peace_agreement_lag |  -1653.641   868.1618    -1.90   0.062    -3390.829    83.54622
            coldwar |   411.7658   939.3009     0.44   0.663    -1467.771    2291.303
            polity2 |  -131.5134   67.48327    -1.95   0.056    -266.5471    3.520265
              xratf |   -49.2651   15.10505    -3.26   0.002    -79.49022   -19.03997
              labor |  -33.60099   33.31375    -1.01   0.317    -100.2616    33.05966
            v64mean |  -30.18626   59.75652    -0.51   0.615    -149.7588    89.38626
            physint |   283.2284   155.2608     1.82   0.073    -27.44776    593.9047
             worker |   991.6836   407.4727     2.43   0.018     176.3327    1807.035
            v60mean |   2.325114   19.63001     0.12   0.906    -36.95444    41.60467
              _cons |   1224.536   3921.908     0.31   0.756    -6623.183    9072.255
-------------------------------------------------------------------------------------

. 
. *adding phystical, integrity, worker's rights, secondary education (women), and Raw Materials
. reg v3Mdiff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag 
>  coldwar polity2 xratf labor v64mean physint worker v60mean v63mean

      Source |       SS           df       MS      Number of obs   =        73
-------------+----------------------------------   F(19, 53)       =      4.56
       Model |   484691038        19  25510054.6   Prob > F        =    0.0000
    Residual |   296650428        53  5597177.88   R-squared       =    0.6203
-------------+----------------------------------   Adj R-squared   =    0.4842
       Total |   781341466        72  10851964.8   Root MSE        =    2365.8

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   2339.656   848.1755     2.76   0.008     638.4312     4040.88
                fv8 |  -.1324188   .1582171    -0.84   0.406    -.4497621    .1849244
               fv10 |   1.42e-08   2.19e-09     6.45   0.000     9.76e-09    1.86e-08
               fv11 |   2.322703   47.43599     0.05   0.961    -92.82185    97.46726
               fv34 |   135.9953   249.4581     0.55   0.588    -364.3542    636.3449
               fv27 |   3017.443   2000.754     1.51   0.137    -995.5619    7030.447
        victory_lag |    281.945   879.2945     0.32   0.750    -1481.696    2045.586
    cw_duration_lag |   52.89881   48.13293     1.10   0.277    -43.64363    149.4412
             damage |   36.04295   14.50756     2.48   0.016     6.944465    65.14143
peace_agreement_lag |  -1548.189   908.0065    -1.71   0.094    -3369.419    273.0413
            coldwar |   689.5635   980.8531     0.70   0.485    -1277.779    2656.906
            polity2 |   -135.387   74.58405    -1.82   0.075    -284.9836    14.20971
              xratf |  -50.79157   15.65664    -3.24   0.002    -82.19481   -19.38834
              labor |    -41.182   35.25792    -1.17   0.248    -111.9004    29.53644
            v64mean |  -47.78328   64.73338    -0.74   0.464     -177.622    82.05543
            physint |   226.3406   169.3376     1.34   0.187    -113.3077    565.9889
             worker |   1113.097   435.7563     2.55   0.014     239.0804    1987.113
            v60mean |   .3135057   21.36868     0.01   0.988    -42.54663    43.17365
            v63mean |  -9.412055   11.44596    -0.82   0.415    -32.36974    13.54563
              _cons |   2901.734   4360.696     0.67   0.509    -5844.715    11648.18
-------------------------------------------------------------------------------------

. 
. *appendix a: cem equation
. *several coarsened techniques were tried. the automated procedure produced the most balanced dataset, so w
> e used that in our analysis.
. cem peace_agreement_lag damage victory_lag  issue_territory_lag, tr(truthvictim)

Matching Summary:
-----------------
Number of strata: 21
Number of matched strata: 7

            0   1
      All  77  18
  Matched  65  10
Unmatched  12   8


Multivariate L1 distance: .37816092

Univariate imbalance:

                          L1     mean      min      25%      50%      75%      max
peace_agreement_lag  3.1e-16  2.8e-16        0        0        0        0        0
             damage   .21724   2.8436   3.5951   8.2578        0   8.7018   .23404
        victory_lag  1.7e-16  1.4e-17        0        0        0        0        0
issue_territory_lag  1.4e-16  2.8e-16        0        0        0        0        0

. reg v3Mdiff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag 
>  coldwar polity2 xratf labor v64mean [iweight=cem_weights]

      Source |       SS           df       MS      Number of obs   =        75
-------------+----------------------------------   F(15, 59)       =      4.40
       Model |   362610755        15  24174050.3   Prob > F        =    0.0000
    Residual |   324049457        59  5492363.67   R-squared       =    0.5281
-------------+----------------------------------   Adj R-squared   =    0.4081
       Total |   686660211        74  9279192.05   Root MSE        =    2343.6

-------------------------------------------------------------------------------------
            v3Mdiff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   2949.536   842.6741     3.50   0.001     1263.349    4635.723
                fv8 |  -.2067042    .202865    -1.02   0.312    -.6126362    .1992278
               fv10 |   1.00e-08   2.00e-09     5.00   0.000     6.01e-09    1.40e-08
               fv11 |   95.41423   62.31207     1.53   0.131    -29.27192    220.1004
               fv34 |   81.09243   252.2559     0.32   0.749    -423.6706    585.8554
               fv27 |   1644.743   1873.346     0.88   0.384    -2103.815      5393.3
        victory_lag |  -61.54325   1190.813    -0.05   0.959    -2444.354    2321.268
    cw_duration_lag |   58.02618   45.29113     1.28   0.205    -32.60116    148.6535
             damage |   46.59294   26.62645     1.75   0.085    -6.686469    99.87234
peace_agreement_lag |  -1423.092   736.5025    -1.93   0.058     -2896.83    50.64579
            coldwar |  -345.0584   1029.472    -0.34   0.739    -2405.028    1714.911
            polity2 |  -76.88571   71.89557    -1.07   0.289    -220.7484      66.977
              xratf |  -36.09159   18.29771    -1.97   0.053    -72.70522    .5220319
              labor |  -16.43298   34.63736    -0.47   0.637    -85.74217    52.87622
            v64mean |   -26.6663   48.25452    -0.55   0.583    -123.2234    69.89076
              _cons |   2517.978   3858.376     0.65   0.517    -5202.614    10238.57
-------------------------------------------------------------------------------------

. 
. reg v2diff truthvictim fv8 fv10 fv11 fv34 fv27  victory_lag cw_duration_lag  damage  peace_agreement_lag  
> coldwar polity2 xratf labor v64mean [iweight=cem_weights]

      Source |       SS           df       MS      Number of obs   =        75
-------------+----------------------------------   F(15, 59)       =      1.14
       Model |  744.459537        15  49.6306358   Prob > F        =    0.3421
    Residual |  2565.06768        59  43.4757234   R-squared       =    0.2249
-------------+----------------------------------   Adj R-squared   =    0.0279
       Total |  3309.52722        74  44.7233408   Root MSE        =    6.5936

-------------------------------------------------------------------------------------
             v2diff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
        truthvictim |   5.273979   2.370846     2.22   0.030     .5299264    10.01803
                fv8 |    .000685   .0005708     1.20   0.235    -.0004571    .0018271
               fv10 |  -5.42e-12   5.64e-12    -0.96   0.340    -1.67e-11    5.86e-12
               fv11 |   .2640703   .1753137     1.51   0.137    -.0867317    .6148722
               fv34 |   -.229584    .709717    -0.32   0.747    -1.649724    1.190556
               fv27 |  -1.901455   5.270622    -0.36   0.720    -12.44794    8.645035
        victory_lag |  -2.269432   3.350327    -0.68   0.501    -8.973422    4.434558
    cw_duration_lag |   .0568294   .1274257     0.45   0.657    -.1981488    .3118076
             damage |   .1076082    .074913     1.44   0.156    -.0422923    .2575088
peace_agreement_lag |  -1.664596   2.072135    -0.80   0.425    -5.810928    2.481736
            coldwar |  -.0622022   2.896399    -0.02   0.983    -5.857884    5.733479
            polity2 |  -.0215436   .2022767    -0.11   0.916    -.4262984    .3832112
              xratf |   .0245914   .0514802     0.48   0.635    -.0784203    .1276031
              labor |    .082387   .0974515     0.85   0.401     -.112613     .277387
            v64mean |  -.0435144   .1357631    -0.32   0.750    -.3151758    .2281469
              _cons |  -1.439099   10.85546    -0.13   0.895    -23.16083    20.28263
-------------------------------------------------------------------------------------

. 
. 
end of do-file


. exit
no; dataset in memory has changed since last saved
    Save the data or specify option clear to exit anyway.
r(4);

. exit, clear
